Results/ReplicaCountAndLatency/mico/MemGraph/3.txt
/Users/pandey/.sdkman/candidates/java/current/bin/java  -classpath /Users/pandey/work/GRACE/YCSB/conf:/Users/pandey/work/GRACE/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/Users/pandey/work/GRACE/YCSB/grace/target/grace-binding-0.18.0-SNAPSHOT.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/HdrHistogram-2.1.12.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/antlr4-runtime-4.9.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/arangodb-java-driver-7.22.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/bson-5.5.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/bson-record-codec-5.5.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/caffeine-2.3.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-beanutils-1.9.4.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-collections-3.2.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-configuration2-2.8.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-lang3-3.12.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-logging-1.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-text-1.10.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/core-7.22.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/error_prone_annotations-2.11.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/exp4j-0.4.8.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/failureaccess-1.0.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-core-3.6.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-driver-3.7.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-groovy-3.6.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-language-3.6.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-shaded-3.6.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-util-3.7.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-2.5.15-indy.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-cli-picocli-2.5.15.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-console-2.5.15.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-groovysh-2.5.15-indy.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-json-2.5.15-indy.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-jsr223-2.5.15-indy.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-swing-2.5.15.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-templates-2.5.15.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-xml-2.5.15.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/guava-31.1-jre.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/hppc-0.7.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/htrace-core4-4.1.0-incubating.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/http-protocol-7.22.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/ivy-2.5.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/j2objc-annotations-1.3.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jackson-annotations-2.19.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jackson-core-2.19.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jackson-databind-2.19.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jackson-datatype-jakarta-jsonp-2.19.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jackson-serde-json-7.22.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jakarta.json-api-2.1.3.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/janusgraph-driver-1.0.0-rc2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/javatuples-1.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jbcrypt-0.4.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jcabi-log-0.20.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jcabi-manifests-1.2.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jcl-over-slf4j-1.7.25.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jline-2.14.6.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jsr305-3.0.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jts-core-1.17.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/mongodb-driver-core-5.5.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/mongodb-driver-sync-5.5.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/neo4j-java-driver-4.4.3.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-all-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-buffer-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-dns-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-haproxy-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-http-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-http2-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-memcache-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-mqtt-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-redis-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-smtp-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-socks-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-stomp-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-xml-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-common-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-handler-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-handler-proxy-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-handler-ssl-ocsp-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-resolver-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-resolver-dns-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-resolver-dns-classes-macos-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-aarch_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-x86_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-classes-epoll-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-classes-kqueue-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-aarch_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-x86_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-aarch_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-x86_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-native-unix-common-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-rxtx-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-sctp-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-udt-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/noggit-0.8.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/picocli-4.3.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/reactive-streams-1.0.3.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/slf4j-api-1.7.25.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/snakeyaml-1.32.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/spatial4j-0.8.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/vertx-auth-common-4.5.7.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/vertx-core-4.5.7.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/vertx-uri-template-4.5.7.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/vertx-web-client-4.5.7.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/vertx-web-common-4.5.7.jar site.ycsb.Client -t -db site.ycsb.db.GraceClient -P workloads/workload_grace -p HOSTURI=http://localhost:3000 -p DBTYPE=memgraph -p DBURI=bolt://localhost:7687 -p maxexecutiontime=120 -p threadcount=1 -p loadVertexFile=/Users/pandey/work/GRACE/GraphDBData/mico_load_vertices.json -p loadEdgeFile=/Users/pandey/work/GRACE/GraphDBData/mico_load_edges.json -p vertexAddFile=/Users/pandey/work/GRACE/GraphDBData/mico_update_vertices.json -p edgeAddFile=/Users/pandey/work/GRACE/GraphDBData/mico_update_edges.json
Loaded 79736 vertices and 549680 edges
Initializing db: site.ycsb.db.GraceClient
GraceClient  Created
Using Database: site.ycsb.DBWrapper
Starting GRACE client
{deleteproportion=1, loadEdgeFile=/Users/pandey/work/GRACE/GraphDBData/mico_load_edges.json, recordcount=10000, operationcount=20000000, loadVertexFile=/Users/pandey/work/GRACE/GraphDBData/mico_load_vertices.json, edgeAddFile=/Users/pandey/work/GRACE/GraphDBData/mico_update_edges.json, readproportion=1, workload=site.ycsb.workloads.CoreWorkload, threadcount=1, updateproportion=1, DBTYPE=memgraph, dotransactions=true, HOSTURI=http://localhost:3000, createproportion=1, DBURI=bolt://localhost:7687, maxexecutiontime=120, vertexAddFile=/Users/pandey/work/GRACE/GraphDBData/mico_update_vertices.json, readallfields=true, db=site.ycsb.db.GraceClient, requestdistribution=latest}
GRACE HOSTURI: http://localhost:3000
DBTYPE: memgraph
DBURI: bolt://localhost:7687
[OVERALL], RunTime(ms), 120228
[OVERALL], Throughput(ops/sec), 8.03473400538976
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 120
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.09981036031540073
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 120
[TOTAL_GC_TIME_%], Time(%), 0.09981036031540073
[REMOVE_VERTEX], Operations, 55
[REMOVE_VERTEX], AverageLatency(us), 34341.236363636366
[REMOVE_VERTEX], MinLatency(us), 31600
[REMOVE_VERTEX], MaxLatency(us), 49535
[REMOVE_VERTEX], 50thPercentileLatency(us), 33727
[REMOVE_VERTEX], 95thPercentileLatency(us), 40191
[REMOVE_VERTEX], 99thPercentileLatency(us), 49535
[REMOVE_VERTEX], Return=OK, 55
[GET_EDGE_WITH_PROPERTY], Operations, 70
[GET_EDGE_WITH_PROPERTY], AverageLatency(us), 42735.328571428574
[GET_EDGE_WITH_PROPERTY], MinLatency(us), 1060
[GET_EDGE_WITH_PROPERTY], MaxLatency(us), 168703
[GET_EDGE_WITH_PROPERTY], 50thPercentileLatency(us), 5939
[GET_EDGE_WITH_PROPERTY], 95thPercentileLatency(us), 155135
[GET_EDGE_WITH_PROPERTY], 99thPercentileLatency(us), 168703
[GET_EDGE_WITH_PROPERTY], Return=OK, 70
[ADD_EDGE], Operations, 69
[ADD_EDGE], AverageLatency(us), 62448.69565217391
[ADD_EDGE], MinLatency(us), 57152
[ADD_EDGE], MaxLatency(us), 80127
[ADD_EDGE], 50thPercentileLatency(us), 61055
[ADD_EDGE], 95thPercentileLatency(us), 72959
[ADD_EDGE], 99thPercentileLatency(us), 80127
[ADD_EDGE], Return=OK, 69
[GET_VERTEX_WITH_PROPERTY], Operations, 79
[GET_VERTEX_WITH_PROPERTY], AverageLatency(us), 40985.126582278484
[GET_VERTEX_WITH_PROPERTY], MinLatency(us), 929
[GET_VERTEX_WITH_PROPERTY], MaxLatency(us), 164863
[GET_VERTEX_WITH_PROPERTY], 50thPercentileLatency(us), 8359
[GET_VERTEX_WITH_PROPERTY], 95thPercentileLatency(us), 159999
[GET_VERTEX_WITH_PROPERTY], 99thPercentileLatency(us), 164863
[GET_VERTEX_WITH_PROPERTY], Return=OK, 79
[ADD_VERTEX], Operations, 65
[ADD_VERTEX], AverageLatency(us), 9154.0
[ADD_VERTEX], MinLatency(us), 6356
[ADD_VERTEX], MaxLatency(us), 21567
[ADD_VERTEX], 50thPercentileLatency(us), 8139
[ADD_VERTEX], 95thPercentileLatency(us), 16879
[ADD_VERTEX], 99thPercentileLatency(us), 21567
[ADD_VERTEX], Return=OK, 65
[REMOVE_EDGE_PROPERTY], Operations, 77
[REMOVE_EDGE_PROPERTY], AverageLatency(us), 331569.87012987013
[REMOVE_EDGE_PROPERTY], MinLatency(us), 304640
[REMOVE_EDGE_PROPERTY], MaxLatency(us), 814079
[REMOVE_EDGE_PROPERTY], 50thPercentileLatency(us), 320767
[REMOVE_EDGE_PROPERTY], 95thPercentileLatency(us), 368127
[REMOVE_EDGE_PROPERTY], 99thPercentileLatency(us), 814079
[REMOVE_EDGE_PROPERTY], Return=OK, 77
[REMOVE_EDGE], Operations, 64
[REMOVE_EDGE], AverageLatency(us), 703976.0
[REMOVE_EDGE], MinLatency(us), 645632
[REMOVE_EDGE], MaxLatency(us), 869887
[REMOVE_EDGE], 50thPercentileLatency(us), 697343
[REMOVE_EDGE], 95thPercentileLatency(us), 784383
[REMOVE_EDGE], 99thPercentileLatency(us), 869887
[REMOVE_EDGE], Return=OK, 64
[GET_EDGE_LABELS], Operations, 54
[GET_EDGE_LABELS], AverageLatency(us), 39320.25925925926
[GET_EDGE_LABELS], MinLatency(us), 716
[GET_EDGE_LABELS], MaxLatency(us), 160511
[GET_EDGE_LABELS], 50thPercentileLatency(us), 5823
[GET_EDGE_LABELS], 95thPercentileLatency(us), 159359
[GET_EDGE_LABELS], 99thPercentileLatency(us), 160511
[GET_EDGE_LABELS], Return=OK, 54
[REMOVE_VERTEX_PROPERTY], Operations, 74
[REMOVE_VERTEX_PROPERTY], AverageLatency(us), 35648.64864864865
[REMOVE_VERTEX_PROPERTY], MinLatency(us), 30288
[REMOVE_VERTEX_PROPERTY], MaxLatency(us), 232191
[REMOVE_VERTEX_PROPERTY], 50thPercentileLatency(us), 32431
[REMOVE_VERTEX_PROPERTY], 95thPercentileLatency(us), 36895
[REMOVE_VERTEX_PROPERTY], 99thPercentileLatency(us), 232191
[REMOVE_VERTEX_PROPERTY], Return=OK, 74
[GET_VERTEX_COUNT], Operations, 65
[GET_VERTEX_COUNT], AverageLatency(us), 27885.36923076923
[GET_VERTEX_COUNT], MinLatency(us), 953
[GET_VERTEX_COUNT], MaxLatency(us), 165247
[GET_VERTEX_COUNT], 50thPercentileLatency(us), 2667
[GET_VERTEX_COUNT], 95thPercentileLatency(us), 156159
[GET_VERTEX_COUNT], 99thPercentileLatency(us), 165247
[GET_VERTEX_COUNT], Return=OK, 65
[GET_EDGES_WITH_LABEL], Operations, 69
[GET_EDGES_WITH_LABEL], AverageLatency(us), 29092.130434782608
[GET_EDGES_WITH_LABEL], MinLatency(us), 1322
[GET_EDGES_WITH_LABEL], MaxLatency(us), 180223
[GET_EDGES_WITH_LABEL], 50thPercentileLatency(us), 6163
[GET_EDGES_WITH_LABEL], 95thPercentileLatency(us), 157439
[GET_EDGES_WITH_LABEL], 99thPercentileLatency(us), 180223
[GET_EDGES_WITH_LABEL], Return=OK, 69
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1.0
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 1
[CLEANUP], 50thPercentileLatency(us), 1
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 1
[SET_EDGE_PROPERTY], Operations, 72
[SET_EDGE_PROPERTY], AverageLatency(us), 328202.6666666667
[SET_EDGE_PROPERTY], MinLatency(us), 303872
[SET_EDGE_PROPERTY], MaxLatency(us), 377599
[SET_EDGE_PROPERTY], 50thPercentileLatency(us), 327679
[SET_EDGE_PROPERTY], 95thPercentileLatency(us), 347391
[SET_EDGE_PROPERTY], 99thPercentileLatency(us), 377599
[SET_EDGE_PROPERTY], Return=OK, 72
[SET_VERTEX_PROPERTY], Operations, 71
[SET_VERTEX_PROPERTY], AverageLatency(us), 34146.47887323944
[SET_VERTEX_PROPERTY], MinLatency(us), 31200
[SET_VERTEX_PROPERTY], MaxLatency(us), 53631
[SET_VERTEX_PROPERTY], 50thPercentileLatency(us), 33247
[SET_VERTEX_PROPERTY], 95thPercentileLatency(us), 38879
[SET_VERTEX_PROPERTY], 99thPercentileLatency(us), 53631
[SET_VERTEX_PROPERTY], Return=OK, 71
[GET_EDGE_COUNT], Operations, 61
[GET_EDGE_COUNT], AverageLatency(us), 25581.475409836065
[GET_EDGE_COUNT], MinLatency(us), 888
[GET_EDGE_COUNT], MaxLatency(us), 168191
[GET_EDGE_COUNT], 50thPercentileLatency(us), 2603
[GET_EDGE_COUNT], 95thPercentileLatency(us), 120319
[GET_EDGE_COUNT], 99thPercentileLatency(us), 168191
[GET_EDGE_COUNT], Return=OK, 61